# Use dictionary data as a data source and pivot on it
1. Create an array of dictionaries with sample data
2. Add it to a DataFrame
3. Pivot the data

In [2]:
import random
# create some sample data
import pandas
import pandas as pd

data_set_1 = [{"id": x, "rVal": random.randint(1,99),  "type": random.choice(["A", "B", "C"]), "location": random.choice(["Osaka", "Philadelphia", "Tunis", "Busan", "Nairobi"]) }  for x in range(100)]
print(data_set_1)

[{'id': 0, 'rVal': 93, 'type': 'C', 'location': 'Osaka'}, {'id': 1, 'rVal': 35, 'type': 'B', 'location': 'Nairobi'}, {'id': 2, 'rVal': 4, 'type': 'B', 'location': 'Tunis'}, {'id': 3, 'rVal': 91, 'type': 'C', 'location': 'Osaka'}, {'id': 4, 'rVal': 67, 'type': 'A', 'location': 'Osaka'}, {'id': 5, 'rVal': 58, 'type': 'A', 'location': 'Nairobi'}, {'id': 6, 'rVal': 89, 'type': 'C', 'location': 'Philadelphia'}, {'id': 7, 'rVal': 62, 'type': 'C', 'location': 'Nairobi'}, {'id': 8, 'rVal': 94, 'type': 'C', 'location': 'Osaka'}, {'id': 9, 'rVal': 2, 'type': 'A', 'location': 'Nairobi'}, {'id': 10, 'rVal': 22, 'type': 'C', 'location': 'Busan'}, {'id': 11, 'rVal': 87, 'type': 'B', 'location': 'Tunis'}, {'id': 12, 'rVal': 58, 'type': 'A', 'location': 'Philadelphia'}, {'id': 13, 'rVal': 13, 'type': 'C', 'location': 'Nairobi'}, {'id': 14, 'rVal': 34, 'type': 'B', 'location': 'Busan'}, {'id': 15, 'rVal': 75, 'type': 'C', 'location': 'Nairobi'}, {'id': 16, 'rVal': 59, 'type': 'B', 'location': 'Nairobi'}, {'id': 17, 'rVal': 16, 'type': 'C', 'location': 'Busan'}, {'id': 18, 'rVal': 58, 'type': 'C', 'location': 'Philadelphia'}, {'id': 19, 'rVal': 62, 'type': 'A', 'location': 'Philadelphia'}, {'id': 20, 'rVal': 49, 'type': 'B', 'location': 'Nairobi'}, {'id': 21, 'rVal': 76, 'type': 'B', 'location': 'Philadelphia'}, {'id': 22, 'rVal': 35, 'type': 'C', 'location': 'Osaka'}, {'id': 23, 'rVal': 64, 'type': 'B', 'location': 'Busan'}, {'id': 24, 'rVal': 96, 'type': 'C', 'location': 'Tunis'}, {'id': 25, 'rVal': 48, 'type': 'B', 'location': 'Osaka'}, {'id': 26, 'rVal': 69, 'type': 'C', 'location': 'Tunis'}, {'id': 27, 'rVal': 3, 'type': 'B', 'location': 'Tunis'}, {'id': 28, 'rVal': 68, 'type': 'C', 'location': 'Tunis'}, {'id': 29, 'rVal': 48, 'type': 'B', 'location': 'Tunis'}, {'id': 30, 'rVal': 31, 'type': 'B', 'location': 'Philadelphia'}, {'id': 31, 'rVal': 95, 'type': 'B', 'location': 'Nairobi'}, {'id': 32, 'rVal': 20, 'type': 'C', 'location': 'Philadelphia'}, {'id': 33, 'rVal': 18, 'type': 'C', 'location': 'Tunis'}, {'id': 34, 'rVal': 1, 'type': 'C', 'location': 'Philadelphia'}, {'id': 35, 'rVal': 64, 'type': 'B', 'location': 'Philadelphia'}, {'id': 36, 'rVal': 30, 'type': 'B', 'location': 'Osaka'}, {'id': 37, 'rVal': 41, 'type': 'B', 'location': 'Philadelphia'}, {'id': 38, 'rVal': 97, 'type': 'B', 'location': 'Tunis'}, {'id': 39, 'rVal': 84, 'type': 'C', 'location': 'Nairobi'}, {'id': 40, 'rVal': 49, 'type': 'B', 'location': 'Nairobi'}, {'id': 41, 'rVal': 65, 'type': 'B', 'location': 'Tunis'}, {'id': 42, 'rVal': 18, 'type': 'A', 'location': 'Nairobi'}, {'id': 43, 'rVal': 15, 'type': 'B', 'location': 'Busan'}, {'id': 44, 'rVal': 71, 'type': 'A', 'location': 'Tunis'}, {'id': 45, 'rVal': 93, 'type': 'A', 'location': 'Philadelphia'}, {'id': 46, 'rVal': 30, 'type': 'A', 'location': 'Tunis'}, {'id': 47, 'rVal': 97, 'type': 'C', 'location': 'Philadelphia'}, {'id': 48, 'rVal': 92, 'type': 'A', 'location': 'Osaka'}, {'id': 49, 'rVal': 17, 'type': 'B', 'location': 'Nairobi'}, {'id': 50, 'rVal': 15, 'type': 'C', 'location': 'Busan'}, {'id': 51, 'rVal': 36, 'type': 'B', 'location': 'Osaka'}, {'id': 52, 'rVal': 60, 'type': 'A', 'location': 'Tunis'}, {'id': 53, 'rVal': 22, 'type': 'A', 'location': 'Osaka'}, {'id': 54, 'rVal': 32, 'type': 'B', 'location': 'Busan'}, {'id': 55, 'rVal': 77, 'type': 'B', 'location': 'Nairobi'}, {'id': 56, 'rVal': 40, 'type': 'B', 'location': 'Tunis'}, {'id': 57, 'rVal': 72, 'type': 'B', 'location': 'Philadelphia'}, {'id': 58, 'rVal': 39, 'type': 'A', 'location': 'Nairobi'}, {'id': 59, 'rVal': 76, 'type': 'B', 'location': 'Osaka'}, {'id': 60, 'rVal': 79, 'type': 'B', 'location': 'Nairobi'}, {'id': 61, 'rVal': 11, 'type': 'C', 'location': 'Philadelphia'}, {'id': 62, 'rVal': 4, 'type': 'C', 'location': 'Nairobi'}, {'id': 63, 'rVal': 5, 'type': 'C', 'location': 'Osaka'}, {'id': 64, 'rVal': 48, 'type': 'A', 'location': 'Tunis'}, {'id': 65, 'rVal': 68, 'type': 'A', 'location': 'Busan'}, {'id': 66, 'rVal': 40, 'type': 'B', 'location': 'Busan'}, {'id': 67, 'rVal': 13, 'type': 'B', 'location': 'Busan'}, {'id': 68, 'rVal': 20, 'type': 'A', 'location': 'Nairobi'}, {'id': 69, 'rVal': 3, 'type': 'A', 'location': 'Busan'}, {'id': 70, 'rVal': 33, 'type': 'C', 'location': 'Nairobi'}, {'id': 71, 'rVal': 27, 'type': 'C', 'location': 'Busan'}, {'id': 72, 'rVal': 97, 'type': 'A', 'location': 'Nairobi'}, {'id': 73, 'rVal': 15, 'type': 'C', 'location': 'Osaka'}, {'id': 74, 'rVal': 84, 'type': 'C', 'location': 'Osaka'}, {'id': 75, 'rVal': 48, 'type': 'B', 'location': 'Philadelphia'}, {'id': 76, 'rVal': 69, 'type': 'B', 'location': 'Philadelphia'}, {'id': 77, 'rVal': 27, 'type': 'C', 'location': 'Tunis'}, {'id': 78, 'rVal': 20, 'type': 'C', 'location': 'Tunis'}, {'id': 79, 'rVal': 52, 'type': 'B', 'location': 'Tunis'}, {'id': 80, 'rVal': 31, 'type': 'A', 'location': 'Busan'}, {'id': 81, 'rVal': 69, 'type': 'A', 'location': 'Philadelphia'}, {'id': 82, 'rVal': 46, 'type': 'B', 'location': 'Busan'}, {'id': 83, 'rVal': 71, 'type': 'A', 'location': 'Busan'}, {'id': 84, 'rVal': 73, 'type': 'A', 'location': 'Tunis'}, {'id': 85, 'rVal': 1, 'type': 'C', 'location': 'Osaka'}, {'id': 86, 'rVal': 12, 'type': 'C', 'location': 'Tunis'}, {'id': 87, 'rVal': 62, 'type': 'A', 'location': 'Philadelphia'}, {'id': 88, 'rVal': 32, 'type': 'B', 'location': 'Osaka'}, {'id': 89, 'rVal': 36, 'type': 'B', 'location': 'Osaka'}, {'id': 90, 'rVal': 45, 'type': 'C', 'location': 'Busan'}, {'id': 91, 'rVal': 9, 'type': 'A', 'location': 'Philadelphia'}, {'id': 92, 'rVal': 74, 'type': 'C', 'location': 'Philadelphia'}, {'id': 93, 'rVal': 38, 'type': 'B', 'location': 'Philadelphia'}, {'id': 94, 'rVal': 52, 'type': 'A', 'location': 'Busan'}, {'id': 95, 'rVal': 67, 'type': 'A', 'location': 'Nairobi'}, {'id': 96, 'rVal': 64, 'type': 'C', 'location': 'Busan'}, {'id': 97, 'rVal': 74, 'type': 'B', 'location': 'Nairobi'}, {'id': 98, 'rVal': 87, 'type': 'A', 'location': 'Osaka'}, {'id': 99, 'rVal': 84, 'type': 'B', 'location': 'Osaka'}]

## Create a data frame and print it

In [3]:
from pandas import DataFrame

data_frame_1 = pd.DataFrame(data_set_1) #, index=["id", "location", "rVal"])
print(data_frame_1)

    id  rVal type location
0    0    93    C    Osaka
1    1    35    B  Nairobi
2    2     4    B    Tunis
3    3    91    C    Osaka
4    4    67    A    Osaka
..  ..   ...  ...      ...
95  95    67    A  Nairobi
96  96    64    C    Busan
97  97    74    B  Nairobi
98  98    87    A    Osaka
99  99    84    B    Osaka

[100 rows x 4 columns]

## Pivot the data

In [4]:
data_frame_1.pivot_table(index="type", columns="location", values="rVal")

location      Busan    Nairobi      Osaka  Philadelphia      Tunis
type
A         45.000000  43.000000  67.000000     58.833333  56.400000
B         34.857143  59.333333  48.857143     54.875000  49.500000
C         31.500000  45.166667  52.250000     50.000000  44.285714

## Create a DataFrame based on series of data

In [5]:
RECORD_LIMIT : int = 20

data_set_2 = {
    "location": [random.choice(["Victoria", "Miami", "Tel Aviv", "Rotterdam"]) for i in range(RECORD_LIMIT)],
    "type": [random.choice(["A", "B", "C"]) for i in range(RECORD_LIMIT)],
    "rVal" : [random.randint(0,99) for i in range(RECORD_LIMIT)],
    "id" : [i for i in range(RECORD_LIMIT)]

}
data_frame_2 = DataFrame(data_set_2)
print(data_frame_2)

     location type  rVal  id
0       Miami    B    86   0
1       Miami    C    49   1
2       Miami    A    46   2
3    Victoria    B    15   3
4   Rotterdam    B     4   4
5    Tel Aviv    B    61   5
6    Victoria    A    77   6
7    Victoria    A    59   7
8    Tel Aviv    A    75   8
9    Victoria    A    50   9
10  Rotterdam    B    35  10
11  Rotterdam    B    30  11
12   Victoria    B    35  12
13  Rotterdam    A    55  13
14  Rotterdam    A    36  14
15   Tel Aviv    B    83  15
16   Tel Aviv    B    33  16
17      Miami    A    11  17
18   Tel Aviv    C    92  18
19   Victoria    A    67  19

# Filter the DataFrame
Use the query method to filter a DataFrame

In [6]:
data_frame_2.query('type =="A"')

     location type  rVal  id
2       Miami    A    46   2
6    Victoria    A    77   6
7    Victoria    A    59   7
8    Tel Aviv    A    75   8
9    Victoria    A    50   9
13  Rotterdam    A    55  13
14  Rotterdam    A    36  14
17      Miami    A    11  17
19   Victoria    A    67  19

## filter the frame by a list

In [9]:
ids = [2,5,6]
data_frame_2[["id", "location"]].query('id.isin(@ids)')

   id  location
2   2     Miami
5   5  Tel Aviv
6   6  Victoria

# Pivot the DataFrame
 Make the locations into rows and user the type values as columns

In [8]:
pd.pivot_table(data_frame_2, values="rVal", index=["location"],  columns="type")

type           A     B     C
location
Miami      28.50  86.0  49.0
Rotterdam  45.50  23.0   NaN
Tel Aviv   75.00  59.0  92.0
Victoria   63.25  25.0   NaN

# Add a calculated column to a DataFrame
Add a new columnn to a DataFrame with a calculated value by multiplying other values from the DataFrame

In [3]:
import random
import pandas
from pandas import DataFrame

data_frame_3:pandas.DataFrame = DataFrame([{"id": i, "pVal": random.randint(0, 5), "tVal" : random.randint(1,22)} for i in range(10)])
data_frame_3["calculated value"] = data_frame_3.pVal * data_frame_3.tVal

data_frame_3

   id  pVal  tVal  calculated value
0   0     0     8                 0
1   1     4    20                80
2   2     5     6                30
3   3     1    22                22
4   4     4    10                40
5   5     2    17                34
6   6     2    13                26
7   7     0     8                 0
8   8     4     9                36
9   9     1    12                12

## Create a calculated column based on a python function
This example requires the one above to be run first.
Use the 'apply' function to apply a python function to a column in the data table. This example is partially based on this post. https://stackoverflow.com/questions/40045632/adding-a-column-in-pandas-df-using-a-function

In [7]:
def get_status_string(num:int)-> str:
    if num >50: return "high"
    elif num<20: return "low"
    else: return "normal"

data_frame_3["status"] = data_frame_3["calculated value"].apply(get_status_string)
data_frame_3

   id  pVal  tVal  calculated value  status
0   0     0     8                 0     low
1   1     4    20                80    high
2   2     5     6                30  normal
3   3     1    22                22  normal
4   4     4    10                40  normal
5   5     2    17                34  normal
6   6     2    13                26  normal
7   7     0     8                 0     low
8   8     4     9                36  normal
9   9     1    12                12     low